from typing import List


class Товар:

    def __init__(self, назва: str, ціна: float, опис: str, категорія: str):
        self.назва = назва
        self.ціна = ціна
        self.опис = опис
        self.категорія = категорія

    def __repr__(self):
        return f"{self.назва} ({self.ціна})"


class Користувач:

    def __init__(self, логін: str, пароль: str):
        self.логін = логін
        self.пароль = пароль
        self.історія_покупок = []

    def __repr__(self):
        return f"{self.логін} ({self.історія_покупок})"


class Замовлення:

    def __init__(self, товари: List[Товар], кількість: List[int], загальна_вартість: float, статус: str):
        self.товари = товари
        self.кількість = кількість
        self.загальна_вартість = загальна_вартість
        self.статус = статус

    def __repr__(self):
        return f"{self.загальна_вартість} ({self.статус})"


interface ISearchable:

    def знайти_товари(self, критерій: str) -> List[Товар]:
        pass


class Магазин(ISearchable):

    def __init__(self):
        self.товари = []
        self.користувачі = []
        self.замовлення = []

    def додати_товар(self, товар: Товар):
        self.товари.append(товар)

    def додати_користувача(self, користувач: Користувач):
        self.користувачі.append(користувач)

    def зробити_замовлення(self, користувач: Користувач, товари: List[Товар], кількість: List[int]):
        замовлення = Замовлення(товари, кількість, 0, "Нове")
        замовлення.загальна_вартість = sum([товар.ціна * кількість for товар, кількість in zip(товари, кількість)])
        користувач.історія_покупок.append(замовлення)
        self.замовлення.append(замовлення)

    def знайти_товари(self, критерій: str) -> List[Товар]:
        результати = []
        for товар in self.товари:
            if критерій in товар.назва or критерій in товар.опис or критерій in товар.категорія:
                результати.append(товар)
        return результати

    def виконати_замовлення(self, замовлення: Замовлення):
        замовлення.статус = "Виконано"


if __name__ == "__main__":
    # Створюємо магазин
    магазин = Магазин()

    # Додаємо товари
    магазин.додати_товар(Товар("М'яч", 100, "М'яч для гри в футбол", "Спорт"))
    магазин.додати_товар(Товар("Книга", 200, "Книга про історію України", "Книги"))
    магазин.додати_товар(Товар("Смартфон", 10000, "Смартфон Samsung Galaxy S23", "Електроніка"))

    # Створюємо користувача
    користувач = Користувач("user", "password")

    # Робимо замовлення
    магазин.зробити_замовлення(користувач, [магазин.товари[0], магазин.товари[1]], [1, 2])

    # Знаходимо товари за назвою
    результати = магазин.знайти_товари("м'яч")
    print(результати)

    # Знаходимо товари за категорією
    результати = магазин.знайти_товари("електроніка")
    print(результати)

    # Виконуємо замовлення
    магазин.виконати_замовлення(магазин.
